CS3300-Software Engineering 1/HW2/app/controllers/projects_controller.rb

  def show
    id = params[:id] # retrieve project task ID from URI route
    @project = Project.find(id) # look up project task by unique ID
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "1"]]

    end

    if @params.is_a? Hash
      @projects = Project.all(:order => order, :conditions => { :user => @params.keys});
---
SELECT "projects".* FROM "projects" WHERE "projects"."user" IN ('Coulson', 'May', 'Simmons', 'Ward') ORDER BY due_date

  def create
    @project = Project.create!(params[:project])
---
INSERT INTO "projects" ("created_at", "description", "due_date", "extended_description", "title", "updated_at", "user") VALUES (?, ?, ?, ?, ?, ?, ?)

  def edit
    @project = Project.find params[:id]
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "1"]]

  def update
    @project = Project.find params[:id]
    @project.update_attributes!(params[:project])
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "8"]]
UPDATE "projects" SET "extended_description" = 'Notes will be displayed on screen only. All team members can see all notes/updates upon logging into the system.', "user" = 'Simmons', "updated_at" = '2014-09-30 20:44:30.531303' WHERE "projects"."id" = 8